SistemaTicketsOBU/code/app/Controllers/Cajas.php

    public function index()
    {
        $tipoComidaId = HorarioComedor::turnoActual();

        $plato = null;
        $ticket = null;

        if ($tipoComidaId !== null) {
            $platoModel = new PlatoModel();
            $plato = $platoModel->obtenerPlatoDelDia(date('Y-m-d'), $tipoComidaId);

            // ✅ Obtener ticket del estudiante si ya fue generado hoy para el turno actual
            $ticketModel = new TicketModel();
            $ticket = $ticketModel
                ->where('student_id', session('id_estudiante'))
                ->where('fecha', date('Y-m-d'))
                ->where('tipo_comida_id', $tipoComidaId)
                ->first();
---
SELECT *
FROM `tickets`
WHERE `student_id` = '1'
AND `fecha` = '2025-07-21'
AND `tipo_comida_id` = 1
 LIMIT 1