SistemaTicketsOBU/code/app/Controllers/TicketEstudiante.php

SELECT *
FROM `tickets`
WHERE `student_id` = '2'
AND `fecha` = '2025-07-21'
AND `tipo_comida_id` = 2
 LIMIT 1
---
    public function hoy()
    {
        $id = session()->get('id_estudiante');
        $fecha = date('Y-m-d');
        $tipoComidaId = 2;

        $modelo = new TicketModel();
        $ticket = $modelo
            ->where('student_id', $id)
            ->where('fecha', $fecha)
            ->where('tipo_comida_id', $tipoComidaId)
            ->first();

INSERT INTO `tickets` (`student_id`, `fecha`, `tipo_comida_id`, `estado`) VALUES ('2', '2025-07-21', 2, 'pendiente')
---

    $nroOrden = $ticketModel->contarTicketsEmitidos($fecha, $tipoComidaId, $becado) + 1;

    $ticketModel->insert([
        'student_id'     => $studentId,
        'fecha'          => $fecha,
        'tipo_comida_id' => $tipoComidaId,
        'estado'         => 'pendiente'
    ]);

SELECT `tickets`.*, `students`.`full_name`, `students`.`university_code`, `students`.`is_scholarship`
FROM `tickets`
JOIN `students` ON `students`.`id` = `tickets`.`student_id`
WHERE `tickets`.`id` = '32'
---
   public function pdf($id = null)
{
    require_once(APPPATH.'ThirdParty/tcpdf/tcpdf.php');

    $ticketModel = new TicketModel();

    $ticket = $ticketModel
        ->join('students', 'students.id = tickets.student_id')
        ->select('tickets.*, students.full_name, students.university_code, students.is_scholarship')
        ->find($id);