SistemaTicketsOBU/code/app/Models/TicketModel.php

SELECT *
FROM `tickets`
WHERE `student_id` = '2'
AND `fecha` = '2025-07-21'
AND `tipo_comida_id` = 2
 LIMIT 1
---
    public function verificarDisponibilidad($studentId, $fecha, $tipoComidaId)
{
    return !$this->where('student_id', $studentId)
                 ->where('fecha', $fecha)
                 ->where('tipo_comida_id', $tipoComidaId)
                 ->first();

SELECT COUNT(*) AS `numrows`
FROM `tickets`
JOIN `students` ON `students`.`id` = `tickets`.`student_id`
WHERE `fecha` = '2025-07-21'
AND `tipo_comida_id` = 2
AND `students`.`is_scholarship` = 0
---
    public function contarTicketsEmitidos($fecha, $tipoComidaId, $becado)
    {
        return $this->db->table($this->table)
            ->join('students', 'students.id = tickets.student_id')
            ->where('fecha', $fecha)
            ->where('tipo_comida_id', $tipoComidaId)
            ->where('students.is_scholarship', $becado)
            ->countAllResults();